# U.S. Medical Insurance Costs

In [3]:
import pandas as pd

In [8]:
# create a dataframe object and Read csv file 
df = pd.read_csv("insurance.csv")

In [15]:
# How many row and columns does the data set have
df.shape

(1338, 7)

In [18]:
# How about we have a look at the first few rows in this dataframe
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [20]:
# Lets look at the last few rows in the dataframe
df.tail()

      age     sex    bmi  children smoker     region     charges
1333   50    male  30.97         3     no  northwest  10600.5483
1334   18  female  31.92         0     no  northeast   2205.9808
1335   18  female  36.85         0     no  southeast   1629.8335
1336   21  female  25.80         0     no  southwest   2007.9450
1337   61  female  29.07         0    yes  northwest  29141.3603

In [ ]:
# let's get the average insurance cost 
for average_cost in insurance_cost:
    average_cost